---
type: ExportFontKey
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# ExportFontKey

`Autodesk.Revit.DB.ExportFontKey` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportFontKey | — | `` |
| Constructor | ExportFontKey | 2014 | `public ExportFontKey ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OriginalFontName | 2014 | `public string OriginalFontName { get ; set ; }` |